Repository: scroodge/MyKid
Catalog: lib/l10n/app_*.arb
Languages: be, ru

# appTitle
source: MyKid Journal
be: Дзённік MyKid
ru: Дневник MyKid

# appDescription
source: Baby diary & child moments
be: Дзіцячы дзённік і моманты дзіцяці
ru: Детский дневник и моменты ребёнка

# signInSubtitle
source: Sign in to sync your journal
be: Увайдзіце, каб сінхранізаваць дзённік
ru: Войдите, чтобы синхронизировать дневник

source: Password
be: Пароль
ru: Пароль

source: Sign in
be: Увайсці
ru: Войти

source: Create account
be: Стварыць акаўнт
ru: Создать аккаунт

# signUpTitle
source: Sign up for MyKid Journal
be: Рэгістрацыя ў Дзённік MyKid
ru: Регистрация в MyKid Journal

# signUpSubtitle
source: Enter your email and choose a password.
be: Увядзіце email і прыдумайце пароль.
ru: Введите email и придумайте пароль.

source: Enter your email
be: Увядзіце email
ru: Введите email

# enterValidEmail
source: Enter a valid email
be: Увядзіце карэктны email
ru: Введите корректный email

# choosePassword
source: Choose a password
be: Прыдумайце пароль
ru: Придумайте пароль

# passwordMinLength
source: Password must be at least 6 characters
be: Пароль павінен быць не менш 6 сімвалаў
ru: Пароль должен быть не менее 6 символов

source: Confirm password
be: Пацвердзіце пароль
ru: Подтвердите пароль

source: Passwords do not match
be: Паролі не супадаюць
ru: Пароли не совпадают

source: Sign up
be: Зарэгістравацца
ru: Зарегистрироваться

# alreadyHaveAccount
source: Already have an account? Sign in
be: Ужо ёсць акаўнт? Увайсці
ru: Уже есть аккаунт? Войти

# checkEmailConfirm
source: Check your email to confirm your account.
be: Праверце пошту, каб пацвердзіць акаўнт.
ru: Проверьте почту, чтобы подтвердить аккаунт.

# signUpDisabled
source: Sign-up is disabled. In Supabase: Authentication → Providers → Email → turn on "Allow new users to sign up".
be: Рэгістрацыя адключана. У Supabase: Authentication → Providers → Email уключыце «Allow new users to sign up».
ru: Регистрация отключена. В Supabase: Authentication → Providers → Email включите «Allow new users to sign up».

source: Settings
be: Налады
ru: Настройки

source: Profile
be: Профіль
ru: Профиль

source: Edit
be: Змяніць
ru: Изменить

source: Family
be: Сям'я
ru: Семья

source: Manage children
be: Дзеці
ru: Дети

# manageChildrenSubtitle
source: Name, date of birth. Photos can be saved to a child's Immich album.
be: Імя, дата нараджэння. Фота можна захоўваць у альбом Immich дзіцяці.
ru: Имя, дата рождения. Фото можно сохранять в альбом Immich ребёнка.

source: Sync
be: Сінхранізацыя
ru: Синхронизация

# immichSubtitle
source: Server URL and API key
be: URL сервера і API-ключ
ru: URL сервера и API-ключ

source: Account
be: Акаўнт
ru: Аккаунт

source: Sign out
be: Выйсці
ru: Выйти

# version
source: Version {version}
be: Версія {version}
ru: Версия {version}

source: Save
be: Захаваць
ru: Сохранить

# immichDescription
source: Your Immich server URL and API key (create key in Immich Settings → API Keys). A successful Test connection saves them.
be: URL сервера Immich і API-ключ (стварыце ключ у Immich: Налады → API Keys). Паспяховая праверка падключэння захоўвае іх.
ru: URL сервера Immich и API-ключ (создайте ключ в Immich: Настройки → API Keys). Успешная проверка подключения сохраняет их.

source: Server URL
be: URL сервера
ru: URL сервера

source: API Key
be: API-ключ
ru: API-ключ

# enterUrlAndKey
source: Enter URL and API key
be: Увядзіце URL і API-ключ
ru: Введите URL и API-ключ

source: Connected successfully
be: Падключана
ru: Подключено

source: Connection failed
be: Памылка падключэння
ru: Ошибка подключения

source: Test connection
be: Праверыць падключэнне
ru: Проверить подключение

source: Testing...
be: Праверка…
ru: Проверка…

source: Connected and saved
be: Падключана і захавана
ru: Подключено и сохранено

source: Saved
be: Захавана
ru: Сохранено

source: Children
be: Дзеці
ru: Дети

source: No children yet
be: Пакуль няма дзяцей
ru: Пока нет детей

source: Add child
be: Дадаць дзіця
ru: Добавить ребёнка

source: Delete child?
be: Выдаліць дзіця?
ru: Удалить ребёнка?

# deleteChildConfirm
source: Remove "{name}"? Journal entries will not be deleted.
be: Выдаліць «{name}»? Запісы дзённіка не выдаляюцца.
ru: Удалить «{name}»? Записи дневника не удаляются.

source: Cancel
be: Скасаваць
ru: Отмена

source: Delete
be: Выдаліць
ru: Удалить

# bornDate
source: Born {day}.{month}.{year}
be: Нарадзіўся(лася) {day}.{month}.{year}
ru: Родился(ась) {day}.{month}.{year}

source: Edit child
be: Рэдагаваць дзіця
ru: Редактировать ребёнка

source: Tap to add or change photo
be: Націсніце, каб дадаць або змяніць фота
ru: Нажмите, чтобы добавить или сменить фото

source: Name
be: Імя
ru: Имя

source: Date of birth (optional)
be: Дата нараджэння (неабавязкова)
ru: Дата рождения (необязательно)

source: Camera
be: Камера
ru: Камера

source: Gallery
be: Галерэя
ru: Галерея

source: Crop photo
be: Абразаць фота
ru: Обрезать фото

# photoWillBeSaved
source: Photo will be saved with the profile
be: Фота будзе захавана ў профілі
ru: Фото будет сохранено в профиле

source: Photo updated
be: Фота абноўлена
ru: Фото обновлено

# uploadFailedAvatar
source: Upload failed. Create bucket "avatars" in Supabase Storage (public).
be: Памылка загрузкі. Стварыце bucket «avatars» у Supabase Storage (public).
ru: Ошибка загрузки. Создайте bucket «avatars» в Supabase Storage (public).

# uploadFailedChildAvatar
source: Upload failed. Check Storage policies for child avatars.
be: Памылка загрузкі. Праверце палітыкі Storage для аватараў дзяцей.
ru: Ошибка загрузки. Проверьте политики Storage для аватаров детей.

# configureImmichFirst
source: Configure Immich in Settings first
be: Спачатку наладзьце Immich у Наладах
ru: Сначала настройте Immich в Настройках

source: From camera
be: З камеры
ru: С камеры

# fromCameraSubtitle
source: Take a photo now, date = today
be: Сфатаграфаваць зараз, дата — сёння
ru: Сфотографировать сейчас, дата — сегодня

source: From gallery
be: З галерэі
ru: Из галереи

# fromGallerySubtitle
source: Pick a photo, date & place from photo
be: Выбраць фота, дата і месца з фота
ru: Выбрать фото, дата и место из фото

source: Empty entry
be: Пусты запіс
ru: Пустая запись

source: Batch import
be: Масавы імпорт
ru: Массовый импорт

# batchImportTooltip
source: Batch import
be: Масавы імпорт
ru: Массовый импорт

source: Timeline
be: Стужка
ru: Лента

# addChildPrompt
source: Add child
be: Дадаць дзіця
ru: Добавить ребёнка

# addChildPromptSubtitle
source: Tap to create profile
be: Націсніце, каб стварыць профіль
ru: Нажмите, чтобы создать профиль

source: Select child above
be: Выберыце дзіця вышэй
ru: Выберите ребёнка выше

source: No entries
be: Няма запісаў
ru: Нет записей

source: Add first entry
be: Дадаць першы запіс
ru: Добавить первую запись

source: No entries yet
be: Пакуль няма запісаў
ru: Пока нет записей

source: Add entry
be: Дадаць запіс
ru: Добавить запись

source: Retry
be: Паўтарыць
ru: Повторить

source: Today
be: Сёння
ru: Сегодня

source: Yesterday
be: Учора
ru: Вчера

source: No title
be: Без назвы
ru: Без названия

# photosCount
source: {count} photo(s)
be: {count} фота
ru: {count} фото

source: New entry
be: Новы запіс
ru: Новая запись

source: Entry
be: Запіс
ru: Запись

source: Delete entry?
be: Выдаліць запіс?
ru: Удалить запись?

# alsoRemoveFromAlbum
source: Also remove photos from child's album
be: Таксама выдаліць фота з альбома дзіцяці
ru: Также удалить фото из альбома ребёнка

source: Date
be: Дата
ru: Дата

source: Child
be: Дзіця
ru: Ребёнок

# addChildInSettings
source: Add a child in Settings → Manage children
be: Дадайце дзіця ў Наладах → Дзеці
ru: Добавьте ребёнка в Настройках → Дети

source: Place (optional)
be: Месца (неабавязкова)
ru: Место (необязательно)

# placeHint
source: e.g. from photo or type here
be: напрыклад, з фота або ўвядзіце ўручную
ru: например, из фото или введите вручную

source: Description
be: Апісанне
ru: Описание

# descriptionHint
source: What happened today?
be: Што здарылася сёння?
ru: Что произошло сегодня?

source: Photos / videos
be: Фота / відэа
ru: Фото / видео

source: Add
be: Дадаць
ru: Добавить

# noMediaAttached
source: No media attached. Add via "Add" or batch import.
be: Няма медыя. Дадайце праз «Дадаць» або масавы імпорт.
ru: Нет медиа. Добавьте через «Добавить» или массовый импорт.

source: Pending (save to upload)
be: Чакае (загрузка пры захаванні)
ru: Ожидает (загрузка при сохранении)

source: Could not read image
be: Не ўдалося прачытаць выяву
ru: Не удалось прочитать изображение

# uploadFailedWithError
source: Upload failed: {error}
be: Памылка загрузкі: {error}
ru: Ошибка загрузки: {error}

source: Select a child
be: Выберыце дзіця
ru: Выберите ребёнка

source: Pick files and upload
be: Выбраць файлы і загрузіць
ru: Выбрать файлы и загрузить

source: Picking...
be: Выбар…
ru: Выбор…

source: Uploading...
be: Загрузка…
ru: Загрузка…

# uploadedCount
source: Uploaded {current} / {total}
be: Загружана {current} з {total}
ru: Загружено {current} из {total}

# batchImportDescription
source: Select multiple photos/videos from your device. They will be uploaded to Immich, then you can create one journal entry with all of them.
be: Выберыце некалькі фота або відэа з прылады. Яны будуць загружаны ў Immich, затым можна стварыць адзін запіс са усімі.
ru: Выберите несколько фото или видео с устройства. Они будут загружены в Immich, затем можно создать одну запись со всеми.

# noValidFiles
source: No valid files selected
be: Няма падыходзячых файлаў
ru: Нет подходящих файлов

# filesUploadedCount
source: {count} file(s) uploaded.
be: Загружана файлаў: {count}
ru: Загружено файлов: {count}

# createOneEntryWithAll
source: Create one journal entry with all
be: Стварыць адзін запіс са усімі
ru: Создать одну запись со всеми

source: Your name
be: Ваша імя
ru: Ваше имя

source: Profile updated
be: Профіль абноўлены
ru: Профиль обновлён

# ageYearsMonthsDays
source: {years} y {months} m {days} d
be: {years} г. {months} мес. {days} дн.
ru: {years} г. {months} мес. {days} дн.

# ageMonthsDays
source: {months} m {days} d
be: {months} мес. {days} дн.
ru: {months} мес. {days} дн.

# ageDays
source: {days} d
be: {days} дн.
ru: {days} дн.

# useFamilyImmich
source: Use family's Immich
be: Выкарыстоўваць Immich сям'і
ru: Использовать Immich семьи

# useFamilyImmichDescription
source: Your family has Immich configured. Use it on this device? The server URL and API key will be saved locally.
be: У сям'і наладжаны Immich. Выкарыстоўваць на гэтай прыладзе? URL і API-ключ будуць захаваны лакальна.
ru: У семьи настроен Immich. Использовать его на этом устройстве? URL и API-ключ будут сохранены локально.

source: Save to family
be: Захаваць для сям'і
ru: Сохранить в семью

# saveToFamilyDescription
source: Store the current Immich server URL and API key for your family? Other members will be able to use the same Immich. The key is stored encrypted in the cloud.
be: Захаваць бягучыя URL і API-ключ Immich для сям'і? Іншыя ўдзельнікі змогуць выкарыстоўваць той жа Immich. Ключ захоўваецца ў воблаку ў зашыфраваным выглядзе.
ru: Сохранить текущие URL и API-ключ Immich для семьи? Остальные участники смогут использовать тот же Immich. Ключ хранится в облаке в зашифрованном виде.

# useFamilyImmichFailed
source: Could not load family Immich settings
be: Не ўдалося загрузіць налады Immich сям'і
ru: Не удалось загрузить настройки Immich семьи

source: Invite to family
be: Запрасіць у сям'ю
ru: Пригласить в семью

# inviteEmailHint
source: Enter email address
be: Увядзіце email
ru: Введите email

source: Create invite
be: Стварыць запрашэнне
ru: Создать приглашение

source: Invite created
be: Запрашэнне створана
ru: Приглашение создано

source: Invite link
be: Спасылка запрашэння
ru: Ссылка приглашения

source: Invite code
be: Код запрашэння
ru: Код приглашения

# copyInviteLink
source: Copy link
be: Скапіяваць спасылку
ru: Копировать ссылку

# copyInviteCode
source: Copy code
be: Скапіяваць код
ru: Копировать код

# inviteCopied
source: Copied to clipboard
be: Скапіявана
ru: Скопировано

source: Pending invites
be: Чакаючыя запрашэнні
ru: Ожидающие приглашения

# noInvites
source: No pending invites
be: Няма чакаючых запрашэнняў
ru: Нет ожидающих приглашений

# inviteExpires
source: Expires {date}
be: Сканчаецца {date}
ru: Истекает {date}

source: Cancel invite
be: Скасаваць запрашэнне
ru: Отменить приглашение

# cancelInviteConfirm
source: Cancel invitation to {email}?
be: Скасаваць запрашэнне для {email}?
ru: Отменить приглашение для {email}?

source: Accept invite
be: Прыняць запрашэнне
ru: Принять приглашение

# acceptInviteTitle
source: Join family
be: Далучыцца да сям'і
ru: Присоединиться к семье

# acceptInviteDescription
source: You've been invited to join a family. Accept to access shared children and journal entries.
be: Вас запрасілі ў сям'ю. Прыміце запрашэнне, каб атрымаць доступ да агульных дзяцей і запісаў дзённіка.
ru: Вас пригласили в семью. Примите приглашение, чтобы получить доступ к общим детям и записям дневника.

# inviteNotFound
source: Invite not found or expired
be: Запрашэнне не знойдзена або скончылася
ru: Приглашение не найдено или истекло

# inviteCodeTooShort
source: Enter at least 8 characters
be: Увядзіце не менш за 8 сімвалаў
ru: Введите не менее 8 символов

# inviteAccepted
source: You've joined the family
be: Вы далучыліся да сям'і
ru: Вы присоединились к семье

# alreadyMember
source: You're already a member of this family
be: Вы ўжо з'яўляецеся членам гэтай сям'і
ru: Вы уже являетесь членом этой семьи

# inviteAcceptFailed
source: Failed to accept invite
be: Не ўдалося прыняць запрашэнне
ru: Не удалось принять приглашение

# sendInviteEmail
source: Send email
be: Адправіць email
ru: Отправить email

# sendInviteEmailDescription
source: Send invitation email to {email}
be: Адправіць запрашэнне на {email}
ru: Отправить приглашение на {email}

# inviteEmailSubject
source: Invitation to join MyKid family
be: Запрашэнне ў сям'ю MyKid
ru: Приглашение в семью MyKid

# inviteEmailBody
source: You've been invited to join a family in MyKid! Invite link: {link} Or use invite code: {code} Open the link or enter the code in the MyKid app to accept the invitation.
be: Вас запрасілі ў сям'ю ў MyKid! Спасылка запрашэння: {link} Або выкарыстайце код: {code} Адкрыйце спасылку або ўвядзіце код у дадатку MyKid, каб прыняць запрашэнне.
ru: Вас пригласили в семью в MyKid! Ссылка приглашения: {link} Или используйте код: {code} Откройте ссылку или введите код в приложении MyKid, чтобы принять приглашение.

# inviteEmailSent
source: Invitation email sent
be: Ліст з запрашэннем адпраўлены
ru: Письмо с приглашением отправлено

# inviteEmailSentTo
source: Invitation sent to {email}
be: Запрашэнне адпраўлена на {email}
ru: Приглашение отправлено на {email}

# inviteEmailFailed
source: Failed to send email, but invite was created
be: Не ўдалося адправіць ліст, але запрашэнне створана
ru: Не удалось отправить письмо, но приглашение создано

# createHousehold
source: Create family
be: Стварыць сям'ю
ru: Создать семью

# createHouseholdTitle
source: Create your family
be: Стварыць сям'ю
ru: Создать семью

# createHouseholdDescription
source: Create a family to invite members and share children and journal entries.
be: Стварыце сям'ю, каб запрашаць удзельнікаў і дзяліцца дзецьмі і запісамі дзённіка.
ru: Создайте семью, чтобы приглашать участников и делиться детьми и записями дневника.

# householdName
source: Family name
be: Назва сям'і
ru: Название семьи

# householdNameHint
source: Optional
be: Неабавязкова
ru: Необязательно

# householdCreated
source: Family created
be: Сям'я створана
ru: Семья создана

# createHouseholdFailed
source: Failed to create family
be: Не ўдалося стварыць сям'ю
ru: Не удалось создать семью

# onboardingTitle
source: Setup
be: Налада
ru: Настройка

# onboardingAccountTypeTitle
source: How do you want to start?
be: Як хочаце пачаць?
ru: Как хотите начать?

# onboardingNewAccount
source: New account
be: Новы акаўнт
ru: Новый аккаунт

# onboardingNewAccountSubtitle
source: Create your own Immich and Supabase
be: Стварыце свой Immich і Supabase
ru: Создайте свой Immich и Supabase

# onboardingFamily
source: Family
be: Сям'я
ru: Семья

# onboardingFamilySubtitle
source: Join with invite code (coming soon)
be: Далучыцца па коду запрашэння (скора)
ru: Присоединиться по коду приглашения (скоро)

# onboardingFamilyComingSoon
source: Family onboarding will be available soon. Use New account for now.
be: Сямейная налада скора будзе даступная. Пакуль выкарыстоўвайце «Новы акаўнт».
ru: Семейная настройка скоро будет доступна. Пока используйте «Новый аккаунт».

# onboardingImmichQuestion
source: Do you have an Immich server URL and API key?
be: Ці ёсць у вас URL сервера Immich і API-ключ?
ru: Есть ли у вас URL сервера Immich и API-ключ?

# onboardingImmichYes
source: Yes, I have them
be: Так, ёсць
ru: Да, есть

# onboardingImmichNo
source: No, create one
be: Не, стварыць
ru: Нет, создать

# onboardingCreateImmich
source: Create Immich on PikaPods
be: Стварыць Immich на PikaPods
ru: Создать Immich на PikaPods

# onboardingCreateImmichSubtitle
source: Opens in browser. After setup, return and enter URL and API key.
be: Адкрыецца ў браўзеры. Пасля налады вярніцеся і ўвядзіце URL і API-ключ.
ru: Откроется в браузере. После настройки вернитесь и введите URL и API-ключ.

# onboardingSupabaseDescription
source: Create a project at supabase.com, run migrations, then copy URL and anon key from Settings → API.
be: Стварыце праект на supabase.com, выканайце міграцыі, затым скапіруйце URL і anon key з Settings → API.
ru: Создайте проект на supabase.com, выполните миграции, затем скопируйте URL и anon key из Settings → API.

# onboardingContinue
source: Continue
be: Далей
ru: Далее

# onboardingSkipImmich
source: Skip for now
be: Прапусціць
ru: Пропустить

# onboardingTestAndContinue
source: Test connection and continue
be: Праверыць падключэнне і працягнуць
ru: Проверить подключение и продолжить

source: Legal
be: Правая інфармацыя
ru: Правовая информация

source: Privacy Policy
be: Палітыка канфідэнцыйнасці
ru: Политика конфиденциальности

# termsOfService
source: Terms of Use
be: Умовы выкарыстання
ru: Условия использования

source: Support
be: Падтрымка
ru: Поддержка

# licenses
source: Open Source Licenses
be: Ліцэнзіі адкрытага ПЗ
ru: Лицензии открытого ПО

source: Delete account
be: Выдаліць акаўнт
ru: Удалить аккаунт

# deleteAccountConfirm
source: Delete your account? All your data will be permanently removed. This cannot be undone.
be: Выдаліць акаўнт? Усе вашы даныя будуць беззваротна выдалены. Гэта дзеянне нельга адмяніць.
ru: Удалить аккаунт? Все ваши данные будут безвозвратно удалены. Это действие нельзя отменить.

# deleteAccountConfirmSubtitle
source: You can also request deletion by email.
be: Вы таксама можаце запытаць выдаленне па email.
ru: Вы также можете запросить удаление по email.

# deleteAccountFailed
source: Failed to delete account. Please try again or contact support.
be: Не ўдалося выдаліць акаўнт. Паспрабуйце зноў або звярніцеся ў падтрымку.
ru: Не удалось удалить аккаунт. Попробуйте снова или обратитесь в поддержку.

source: Export my data
be: Экспарт маіх даных
ru: Экспорт моих данных

# exportMyDataSubtitle
source: Request a copy of your data (GDPR)
be: Запытаць копію даных (GDPR)
ru: Запросить копию данных (GDPR)
